Autodesk.Revit.DB.BuiltInFailures.FaceSplitterFailures.NoFaceForSplit
The highlighted element no longer contains a face that has been split by highlighted sketch.

Autodesk.Revit.DB.BuiltInFailures.FaceSplitterFailures.LoopsOutsideFaceSplitError
Some of the lines drawn lie outside of the boundary of the face being split.  All lines used to split a face must be contained
within the face being split and cannot intersect or overlap any of the boundaries of that face.

Autodesk.Revit.DB.BuiltInFailures.FaceSplitterFailures.LoopsDoNotSubdivideFace
Sketched loops must sub-divide the face into two or more completely enclosed regions.

Autodesk.Revit.DB.BuiltInFailures.FaceSplitterFailures.InvalidOpenLoopsForFaceSplit
The open loops used to split the face must lie completely within the face and cannot intersect or overlap any of the face's edges.

Autodesk.Revit.DB.BuiltInFailures.FaceSplitterFailures.InvalidClosedLoopsForFaceSplit
The closed loop used to split the face must lie completely within the face and cannot intersect or overlap any of the face's edges.
To split a face at its border, use an open loop that ends on the boundary of the face.

Autodesk.Revit.DB.BuiltInFailures.FaceSplitterFailures.EndsNotOnEdgeError
Ends of an open loop in sketch splitting face do not lie on an edge of the face to split.

Autodesk.Revit.DB.BuiltInFailures.FaceSplitterFailures.CannotUseCurvesForFaceSplit
The sketch cannot split the face of the highlighted element.

Autodesk.Revit.DB.BuiltInFailures.FaceSplitterFailures
Failures about FaceSplitter.